       IDENTIFICATION DIVISION.
       PROGRAM-ID. day1.
       AUTHOR. Wanja Chresta.
       DATE-WRITTEN. 12-JAN-2025.

       DATA DIVISION.

       PROCEDURE DIVISION.
       DISPLAY "Hello World!".
       STOP RUN.
